Applying **Development**:

```diff
data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=_Q]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-051130e4758cbefc6]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_security_group.lan[0]: Refreshing state... [id=sg-0a07af2652b79d94c]
aws_route_table.public[0]: Refreshing state... [id=rtb-0eaec8617334c504d]
aws_route_table.private[0]: Refreshing state... [id=rtb-0825c4c2745482a5f]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cb1e4146bd120fa9]
aws_subnet.public[0]: Refreshing state... [id=subnet-04d9868d752d0404e]
aws_security_group.trusted[0]: Refreshing state... [id=sg-017957814a9f4d0d3]
aws_subnet.private[0]: Refreshing state... [id=subnet-0a2367b0f15dd447c]
aws_security_group.public[0]: Refreshing state... [id=sg-0af8b40fe3edede8d]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-001bbe242d194374d]
aws_route.public: Refreshing state... [id=r-rtb-0eaec8617334c504d1080289494]
aws_network_interface.private: Refreshing state... [id=eni-000c533f94ba93bb3]
aws_route_table_association.private: Refreshing state... [id=rtbassoc-0705bd1783e57a22b]
aws_network_interface.public: Refreshing state... [id=eni-055bdd985b7153c14]
aws_route.private: Refreshing state... [id=r-rtb-0825c4c2745482a5f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ec2_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_iam_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.secure_storage_master_key will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secure_storage_master_key" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # aws_iam_role.this will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "ec2-iam-role-sophos-xgfd-447552758530"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "ec2-policy-sophos-xgfd"
+           policy = (known after apply)
        }
+       inline_policy {
+           name   = "ssm-policy-sophos-xgfd"
+           policy = (known after apply)
        }
    }

  # aws_secretsmanager_secret.config_backup_password will be created
+   resource "aws_secretsmanager_secret" "config_backup_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-backup-configuration-password"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.console_password will be created
+   resource "aws_secretsmanager_secret" "console_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-console-password"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret" "secure_storage_master_key" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-secure-storage-master-key"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.config_backup_password will be created
+   resource "aws_secretsmanager_secret_version" "config_backup_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.console_password will be created
+   resource "aws_secretsmanager_secret_version" "console_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-017957814a9f4d0d3"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "20.110.96.238/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "20.253.250.61/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

```
random_id.this: Refreshing state... [id=_Q]
data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-051130e4758cbefc6]
random_shuffle.az: Refreshing state... [id=-]
aws_subnet.public[0]: Refreshing state... [id=subnet-04d9868d752d0404e]
aws_subnet.private[0]: Refreshing state... [id=subnet-0a2367b0f15dd447c]
aws_security_group.trusted[0]: Refreshing state... [id=sg-017957814a9f4d0d3]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cb1e4146bd120fa9]
aws_security_group.public[0]: Refreshing state... [id=sg-0af8b40fe3edede8d]
aws_security_group.lan[0]: Refreshing state... [id=sg-0a07af2652b79d94c]
aws_route_table.public[0]: Refreshing state... [id=rtb-0eaec8617334c504d]
aws_route_table.private[0]: Refreshing state... [id=rtb-0825c4c2745482a5f]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-001bbe242d194374d]
aws_route.public: Refreshing state... [id=r-rtb-0eaec8617334c504d1080289494]
aws_network_interface.private: Refreshing state... [id=eni-000c533f94ba93bb3]
aws_network_interface.public: Refreshing state... [id=eni-055bdd985b7153c14]
aws_route_table_association.private: Refreshing state... [id=rtbassoc-0705bd1783e57a22b]
aws_route.private: Refreshing state... [id=r-rtb-0825c4c2745482a5f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ec2_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_iam_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.secure_storage_master_key will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secure_storage_master_key" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-iam-role-sophos-xgfd-447552758530"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "ec2-policy-sophos-xgfd"
          + policy = (known after apply)
        }
      + inline_policy {
          + name   = "ssm-policy-sophos-xgfd"
          + policy = (known after apply)
        }
    }

  # aws_secretsmanager_secret.config_backup_password will be created
  + resource "aws_secretsmanager_secret" "config_backup_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "sophos-fw-backup-configuration-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.console_password will be created
  + resource "aws_secretsmanager_secret" "console_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "sophos-fw-console-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.secure_storage_master_key will be created
  + resource "aws_secretsmanager_secret" "secure_storage_master_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "sophos-fw-secure-storage-master-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.config_backup_password will be created
  + resource "aws_secretsmanager_secret_version" "config_backup_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.console_password will be created
  + resource "aws_secretsmanager_secret_version" "console_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.secure_storage_master_key will be created
  + resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-017957814a9f4d0d3"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "20.110.96.238/32",
                ]
              + description      = "Allow all from trusted IP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          - {
              - cidr_blocks      = [
                  - "20.253.250.61/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
aws_secretsmanager_secret.config_backup_password: Creating...
aws_secretsmanager_secret.secure_storage_master_key: Creating...
aws_secretsmanager_secret.console_password: Creating...
aws_security_group.trusted[0]: Modifying... [id=sg-017957814a9f4d0d3]
aws_secretsmanager_secret.config_backup_password: Creation complete after 1s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-backup-configuration-password-R8Trkh]
aws_secretsmanager_secret_version.config_backup_password: Creating...
aws_secretsmanager_secret.console_password: Creation complete after 1s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-console-password-fHbLZ3]
data.aws_iam_policy_document.ec2_iam_policy: Reading...
data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4132692670]
aws_secretsmanager_secret_version.console_password: Creating...
aws_secretsmanager_secret.secure_storage_master_key: Creation complete after 1s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-secure-storage-master-key-bFSUI3]
data.aws_iam_policy_document.secure_storage_master_key: Reading...
aws_secretsmanager_secret_version.secure_storage_master_key: Creating...
data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=712272081]
aws_iam_role.this: Creating...
aws_secretsmanager_secret_version.config_backup_password: Creation complete after 0s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-backup-configuration-password-R8Trkh|49E0A976-5666-4080-B1E9-088BBF822FB3]
aws_secretsmanager_secret_version.console_password: Creation complete after 0s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-console-password-fHbLZ3|72CD0DAD-1B33-4F9A-A376-669425EF4368]
aws_secretsmanager_secret_version.secure_storage_master_key: Creation complete after 0s [id=arn:aws:secretsmanager:us-west-2:447552758530:secret:sophos-fw-secure-storage-master-key-bFSUI3|A046CBE6-C20C-421C-BEBA-49AE145611F3]
aws_security_group.trusted[0]: Modifications complete after 1s [id=sg-017957814a9f4d0d3]
aws_iam_role.this: Creation complete after 0s [id=ec2-iam-role-sophos-xgfd-447552758530]

Apply complete! Resources: 7 added, 1 changed, 0 destroyed.

```